public_html/docs/Programming/Floating-Point Arithmetic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Floating-Point Arithmetic</title>
<!-- 2014-01-01 Wed 13:34 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Floating-Point Arithmetic</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Docs for Reference</a></li>
<li><a href="#sec-2">The problem of the Floating-Point</a></li>
<li><a href="#sec-3">Rounding Error</a>
<ul>
<li><a href="#sec-3-1">Floating-point Formats</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Docs for Reference</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>What Every Computer Scientist Should Know About Floating-Point
Arithmetic, by David Goldberg
<a href="./What Every Computer Scientist Should Know About Floating-Point Arithmetic.pdf">./What Every Computer Scientist Should Know About Floating-Point Arithmetic.pdf</a>
</li>

<li>Single-precision floating-point format(wikipedia)
  <a href="http://en.wikipedia.org/wiki/Single_precision">http://en.wikipedia.org/wiki/Single_precision</a>
</li>

<li>Double-precision floating-point format
  <a href="http://en.wikipedia.org/wiki/Double_precision">http://en.wikipedia.org/wiki/Double_precision</a>
</li>

<li>Floating point
  <a href="http://en.wikipedia.org/wiki/Floating_point">http://en.wikipedia.org/wiki/Floating_point</a>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The problem of the Floating-Point</h2>
<div class="outline-text-2" id="text-2">
<p>
For example, the real number ‘.37’ cannot be represented exactly by
the arithmetic series described above so, if you assign this number to
a floating point, the value stored could actually be ‘0.370000004’.
This can be seen easily if we write a simple program that prints a
floating point value to a lot of decimal places.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">some code to print a floating point number to a lot of </span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">decimal places</span>
<span style="color: #98fb98;">int</span> <span style="color: #87cefa;">main</span>()
{
    <span style="color: #98fb98;">float</span> <span style="color: #eedd82;">f</span> = .37;
    printf(<span style="color: #ffa07a;">"%.20f\n"</span>, f);
}
</pre>
</div>

<p>
More examples:
</p>
<ul class="org-ul">
<li><a href="http://catless.ncl.ac.uk/php/risks/search.php?query=float">Risks Digest-float</a>
</li>
<li><a href="http://catless.ncl.ac.uk/php/risks/search.php?query=rounding">Risks Digest-rounding</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Rounding Error</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Floating-point Formats</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Several different representations of real numbers have been proposed,
but by far the most widely used is the floating-point
representation.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>Floating-point representations have a base &beta;
(which is always assumed to be even) and a precision <i>p</i>.  If &beta;  = 2 and
<i>p</i> = 24, then the decimal number 0.1 cannot be represented exactly, but
is approximately 1.10011001100110011001101 × 2-4.
</p>


<p>
In general, a floating-point number will be represented as ± d.dd&#x2026; d
×&beta;<sup>e</sup>, where d.dd&#x2026;d is called the <b>significand</b> and has <i>p</i> digits. More
precisely ±d<sub>0</sub>.d<sub>1</sub> d<sub>2</sub> &#x2026; d<sub>p-1</sub> ×&beta;<sup>e</sup> represents the number
</p>

<p>
&plusmn; (d<sub>0</sub>+d<sub>1</sub>&beta;<sup>-1</sup>+&#x2026;+d<sub>p-1</sub>&beta;<sup>-(p-1)</sup>)&beta;<sup>e</sup>, (0&lt; d<sub>i</sub> &lt;&beta;)
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Examples of other representations are floating slash and signed
logarithm [Matula and Kornerup 1985; Swartzlander and Alexopoulos
1975].
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2014-01-01 Wed 13:34</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
